yushuo-ko/rtl8752h_sdk/inc/peripheral/rtl876x_captouch.h
/**
*********************************************************************************************************
*               Copyright(c) 2024, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl876x_captouch.h
* \brief    The header file of the peripheral CAP TOUCH driver.
* \details  This file provides all CAP TOUCH firmware functions.
* \author   Yuan
* \date     2024-11-11
* \version  v1.0.0
* *********************************************************************************************************
*/

/*============================================================================*
 *               Define to prevent recursive inclusion
 *============================================================================*/
#ifndef _RTL876X_CAPTOUCH_H_
#define _RTL876X_CAPTOUCH_H_

#ifdef __cplusplus
extern "C" {
#endif

/**
 * \addtogroup  IO          Peripheral Drivers
 * \defgroup    CTC         CTC
 * \brief       Manage the ENHTIM peripheral functions.
 *
 * \ingroup     IO
 */

/*============================================================================*
 *                         Includes
 *============================================================================*/
#include "rtl876x.h"

/*============================================================================*
 *                         Registers Definitions
 *============================================================================*/

/* Peripheral: CTC */
/* Description: Cap touch register defines */

/* Register: CR */
/* Description: CTC Control Register 0. Offset: 0x00. Address: 0x40007000. */

/* CR[8] :CTC_BASELINE_INI. Baseline initial function enable. 0x1: Enable. 0x0: Disable. */
#define CTC_BASELINE_INI_Pos            (8UL)
#define CTC_BASELINE_INI_Msk            (0x1UL << CTC_BASELINE_INI_Pos)
#define CTC_BASELINE_INI_CLR            (~(CTC_BASELINE_INI_Msk))

/* CR[6:5] :CTC_DEBOUNCE_TIME. De-bounce time setting. 0x1: Enable. 0x0: Disable. */
#define CTC_DEBOUNCE_TIME_Pos           (5UL)
#define CTC_DEBOUNCE_TIME_Msk           (0x03UL << CTC_DEBOUNCE_TIME_Pos)
#define CTC_DEBOUNCE_TIME_CLR           (~(CTC_DEBOUNCE_TIME_Msk))

/* CR[4] :CTC_DEBOUNCE_EN. De-bounce function control. 0x1: Enable. 0x0: Disable. */
#define CTC_DEBOUNCE_EN_Pos             (4UL)
#define CTC_DEBOUNCE_EN_Msk             (0x1UL << CTC_DEBOUNCE_EN_Pos)
#define CTC_DEBOUNCE_EN_CLR             (~(CTC_DEBOUNCE_EN_Msk))

/* CR[0] :CTC_CT_EN. Cap touch function control. 0x1: Enable. 0x0: Disable. */
#define CTC_CT_EN_Pos                   (0UL)
#define CTC_CT_EN_Msk                   (0x1UL << CTC_CT_EN_Pos)
#define CTC_CT_EN_Clr                   (~(CTC_CT_EN_Msk))

/* Register: SCAN_PERIOD */
/* Description: Scan period Register 0. Offset: 0x04. Address: 0x40007004. */

/* SCAN_PERIOD[18:16] :CTC_SAMPLE_AVE. ADC Sampled number for average function. */
#define CTC_SAMPLE_AVE_Pos              (16UL)
#define CTC_SAMPLE_AVE_Msk              (0x7UL << CTC_SAMPLE_AVE_Pos)
#define CTC_SAMPLE_AVE_Clr              (~(CTC_SAMPLE_AVE_Msk))

/* SCAN_PERIOD[11:0] :CTC_SCAN_INTERVAL. Scan interval setting.  */
#define CTC_SCAN_INTERVAL_Pos           (0UL)
#define CTC_SCAN_INTERVAL_Msk           (0xFFFUL << CTC_SCAN_INTERVAL_Pos)
#define CTC_SCAN_INTERVAL_Clr           (~(CTC_SCAN_INTERVAL_Msk))

/* Register: ETC_CR */
/* Description: ETC Register 0. Offset: 0x08. Address: 0x40007008. */

/* ETC_CR[15:12] :CTC_BASELINE_UPDATE_STEP. Baseline update step every time  for all channel. Default: 0001. */
#define CTC_BASELINE_UPDATE_STEP_Pos    (12UL)
#define CTC_BASELINE_UPDATE_STEP_Msk    (0xFUL << CTC_BASELINE_UPDATE_STEP_Pos)
#define CTC_BASELINE_UPDATE_STEP_Clr    (~(CTC_BASELINE_UPDATE_STEP_Msk))

/* ETC_CR[11:8] :CTC_BASELINE_UPD_WT_FACTOR. Baseline update weight factor for all channels. */
#define CTC_BASELINE_UPD_WT_FACTOR_Pos  (8UL)
#define CTC_BASELINE_UPD_WT_FACTOR_Msk  (0xFUL << CTC_BASELINE_UPD_WT_FACTOR_Pos)
#define CTC_BASELINE_UPD_WT_FACTOR_Clr  (~(CTC_BASELINE_UPD_WT_FACTOR_Msk))

/* ETC_CR[7:1] :CTC_ETC_UPDATE_INTERVAL. ETC update interval between 2 scan period(sleep time )for all channel. */
#define CTC_ETC_UPDATE_INTERVAL_Pos     (1UL)
#define CTC_ETC_UPDATE_INTERVAL_Msk     (0x7FUL << CTC_ETC_UPDATE_INTERVAL_Pos)
#define CTC_ETC_UPDATE_INTERVAL_Clr     (~(CTC_ETC_UPDATE_INTERVAL_Msk))

/* ETC_CR[0] :CTC_ETC_EN. Environmental cap tracking calibration function. 0x1: Enable. 0x0: Disable. */
#define CTC_ETC_EN_Pos                  (0UL)
#define CTC_ETC_EN_Msk                  (0x1UL << CTC_ETC_EN_Pos)
#define CTC_ETC_EN_Clr                  (~(CTC_ETC_EN_Msk))

/* Register: SNR_INF */
/* Description: Scan period Register 0. Offset: 0x0C. Address: 0x4000700C. */

/* SNR_INF[31] :CTC_SNR_UPDATE_MODE. SNR update mode. */
#define CTC_SNR_UPDATE_MODE_Pos         (31UL)
#define CTC_SNR_UPDATE_MODE_Msk         (0x1UL << CTC_SNR_UPDATE_MODE_Pos)
#define CTC_SNR_UPDATE_MODE_Clr         (~(CTC_SNR_UPDATE_MODE_Msk))

/* Register: CTC_GUARD_CNT */
/* Description: Guard counter Register. Offset: 0x1C. Address: 0x4000701C. */

/* CTC_GUARD_CNT[20:16] :CTC_DLY_GUARD_INTERVAL. Delay guard interval,1 unit for 32k clock period (31.25us). */
#define CTC_DLY_GUARD_INTERVAL_Pos          (16UL)
#define CTC_DLY_GUARD_INTERVAL_Msk          (0x1FUL << CTC_DLY_GUARD_INTERVAL_Pos)
#define CTC_DLY_GUARD_INTERVAL_Clr          (~(CTC_DLY_GUARD_INTERVAL_Msk))

/* CTC_GUARD_CNT[4:0] :CTC_ADV_GUARD_INTERVAL. Advanced guard interval,1 unit for 32k clock period (31.25us). */
#define CTC_ADV_GUARD_INTERVAL_Pos          (0UL)
#define CTC_ADV_GUARD_INTERVAL_Msk          (0x1FUL << CTC_ADV_GUARD_INTERVAL_Pos)
#define CTC_ADV_GUARD_INTERVAL_Clr          (~(CTC_ADV_GUARD_INTERVAL_Msk))

/*============================================================================*
 *                         Constants
 *============================================================================*/
/**
 * \defgroup    CTC_Exported_Constants CTC Exported Constants
 *
 * \ingroup     CTC
 */

#define IS_CTC_PERIPH(PERIPH) ((PERIPH) == CTC)
#define IS_CTC_CHANNEL(CH) (((CH) == CTC_Channel0)\
                            ||((CH) == CTC_Channel1))

