yushuo-ko/rtl8752h_sdk/inc/peripheral/rtl876x_captouch.h
/* CTC private defines */
#define CTC_ANA_ADC_REG0X_LPAD      *((volatile uint32_t *)0x40007400UL)
#define CTC_ANA_ADC_REG1X_LPAD      *((volatile uint32_t *)0x40007404UL)
#define CTC_ANA_ADC_REG0X_LPSD      *((volatile uint32_t *)0x40007408UL)
#define CTC_ANA_ADC_TIME_SET        *((volatile uint32_t *)0x4000740CUL)
#define CTC_ANA_ADC_POWER_SEQ       *((volatile uint32_t *)0x40007410UL)

#define CTC_CLOCK_SOURCE_1M         1000000
#define CTC_CLOCK_SOURCE_40M        40000000

typedef enum
{
    CTC_SLOW_MODE = 0,
    CTC_FAST_MODE = 1
} E_CTC_MODE;

#define IS_CTC_MODE(mode) (((mode) == CTC_SLOW_MODE) || ((mode) == CTC_FAST_MODE))

typedef enum
{
    CTC_TOUCH_JUDGEMENT_DIFFEENCE = 0,
    CTC_TOUCH_JUDGEMENT_ABSOLUTE = 1,
} E_CTC_TOUCH_JUDGEMENT_MODE;

#define IS_CTC_TOUCH_JUDGEMENT_MODE(mode) (((mode) == CTC_TOUCH_JUDGEMENT_DIFFEENCE) || ((mode) == CTC_TOUCH_JUDGEMENT_ABSOLUTE))


/**
 * \defgroup    CTC_BaselineIni_Enable CTC BaselineIni Enable
 * \{
 * \ingroup     CTC_Exported_Constants
 */
#define CTC_BASELINEINI_DISABLE         0x00
#define CTC_BASELINEINI_ENABLE          0x01
/** \} */

/**
 * \defgroup    CTC_Debounce_Times CTC Debounce Times
 * \{
 * \ingroup     CTC_Exported_Constants
 */
#define CTC_DEBOUNCE_TIMES_2            0x00
#define CTC_DEBOUNCE_TIMES_3            0x01
#define CTC_DEBOUNCE_TIMES_4            0x02
#define CTC_DEBOUNCE_TIMES_5            0x03
/** \} */

/**
 * \defgroup    CTC_Interrupts_Definition CTC Interrupts Definition
 * \{
 * \ingroup     CTC_Exported_Constants
 */
#define CTC_DEBOUNCE_DISABLE            0x00
#define CTC_DEBOUNCE_ENABLE             0x01
/** \} */

/**
 * \defgroup    CTC_Enable CTC Enable
 * \{
 * \ingroup     CTC_Exported_Constants
 */
#define CTC_DISABLE                     0x00
#define CTC_ENABLE                      0x01
/** \} */

/**
 * \defgroup    CTC_Sample_Time CTC Sample Time
 * \{
 * \ingroup     CTC_Exported_Constants
 */
#define CTC_SAMPLE_TIME_AVE_4           0x00
#define CTC_SAMPLE_TIME_AVE_8           0x01
#define CTC_SAMPLE_TIME_AVE_16          0x02
#define CTC_SAMPLE_TIME_AVE_32          0x03
#define CTC_SAMPLE_TIME_AVE_64          0x04
#define CTC_SAMPLE_TIME_AVE_128         0x05
#define CTC_SAMPLE_TIME_AVE_256         0x06
#define CTC_SAMPLE_TIME_AVE_512         0x07
/** \} */

/**
 * \defgroup    CTC_Scan_Interval CTC Scan Interval
 * \{
 * \ingroup     CTC_Exported_Constants
 */
#define CTC_SCAN_INTERVAL_60ms          0x3C
#define CTC_SCAN_INTERVAL_100ms         0x64
#define CTC_SCAN_INTERVAL_140ms         0x8C
#define CTC_SCAN_INTERVAL_180ms         0xB4
#define CTC_SCAN_INTERVAL_220ms         0xDC
#define CTC_SCAN_INTERVAL_260ms         0x104
#define CTC_SCAN_INTERVAL_300ms         0x12C
#define CTC_SCAN_INTERVAL_480ms         0x1E0
/** \} */


/**
 * \defgroup    CTC_Interrupts_Definition CTC Interrupts Definition
 * \{
 * \ingroup     CTC_Exported_Constants
 */
//typedef enum
//{
//  CTC_INT_FALSE_TOUCH_CH1     = BIT20,
//  CTC_INT_FALSE_TOUCH_CH0     = BIT19,
//  CTC_INT_N_NOISE_THD         = BIT18,
//  CTC_INT_FIFO_OVERFLOW       = BIT17,
//  CTC_INT_P_NOISE_THD         = BIT16,
//  CTC_INT_TOUCH_RELEASE_CH1   = BIT9,
//  CTC_INT_TOUCH_RELEASE_CH0   = BIT8,
//  CTC_INT_TOUCH_PRESS_CH1     = BIT1,
//  CTC_INT_TOUCH_PRESS_CH0     = BIT0,
//}E_CTC_INT;

#define CTC_INT_FALSE_TOUCH_CH1     BIT20
#define CTC_INT_FALSE_TOUCH_CH0     BIT19
#define CTC_INT_N_NOISE_THD         BIT18
#define CTC_INT_FIFO_OVERFLOW       BIT17
#define CTC_INT_P_NOISE_THD         BIT16
#define CTC_INT_TOUCH_RELEASE_CH1   BIT9
#define CTC_INT_TOUCH_RELEASE_CH0   BIT8
#define CTC_INT_TOUCH_PRESS_CH1     BIT1
#define CTC_INT_TOUCH_PRESS_CH0     BIT0

/** \} */

#define IS_CTC_INT(INT) (((INT) == CTC_INT_FALSE_TOUCH_CH1) || \
                         ((INT) == CTC_INT_FALSE_TOUCH_CH0) || \
                         ((INT) == CTC_INT_N_NOISE_THD) || \
                         ((INT) == CTC_INT_FIFO_OVERFLOW) || \
                         ((INT) == CTC_INT_P_NOISE_THD) || \
                         ((INT) == CTC_INT_TOUCH_RELEASE_CH1) || \
                         ((INT) == CTC_INT_TOUCH_RELEASE_CH0) || \
                         ((INT) == CTC_INT_TOUCH_PRESS_CH1) || \
                         ((INT) == CTC_INT_TOUCH_PRESS_CH0))

/**
 * \defgroup    CTC_MBIAS_Current CTC MBIAS Current
 * \{
 * \ingroup     CTC_Exported_Constants
 */
//typedef enum
//{
//    CTC_MBIAS_0p25uA    = (1UL << 0),
//    CTC_MBIAS_0p5uA     = (1UL << 1),
//    CTC_MBIAS_1uA       = (1UL << 2),
//    CTC_MBIAS_2uA       = (1UL << 3),
//    CTC_MBIAS_4uA       = (1UL << 4),
//    CTC_MBIAS_8uA       = (1UL << 5)
//} E_CTC_MBIAS;

#define CTC_MBIAS_0p25uA            (1UL << 0)
#define CTC_MBIAS_0p5uA             (1UL << 1)
#define CTC_MBIAS_1uA               (1UL << 2)
#define CTC_MBIAS_2uA               (1UL << 3)
#define CTC_MBIAS_4uA               (1UL << 4)
#define CTC_MBIAS_8uA               (1UL << 5)

/** \} */

#define IS_CTC_MBIAS(mbias) (((mbias) == CTC_MBIAS_0p25uA) ||\
                             ((mbias) == CTC_MBIAS_0p5uA) ||\
                             ((mbias) == CTC_MBIAS_1uA  ) ||\
                             ((mbias) == CTC_MBIAS_2uA  ) ||\
                             ((mbias) == CTC_MBIAS_4uA  ) ||\
                             ((mbias) == CTC_MBIAS_8uA  ))

/**
 * \defgroup    CTC_FS_Match_Count CTC FS Match Count
 * \{
 * \ingroup     CTC_Exported_Constants
 */
typedef enum
{
    CTC_FS_Match_Cnt_No_Switch = 0x0,
    CTC_FS_Match_Cnt_1DB       = 0x01,
    CTC_FS_Match_Cnt_2DB       = 0x02,
    CTC_FS_Match_Cnt_3DB       = 0x03,
    CTC_FS_Match_Cnt_4DB       = 0x04
} E_CTC_MODE_SWITCH;
/** \} */

#define IS_CTC_FS_Match(cnt) (((cnt) == CTC_FS_Match_Cnt_No_Switch) ||\
                              ((cnt) == CTC_FS_Match_Cnt_1DB) ||\
                              ((cnt) == CTC_FS_Match_Cnt_2DB  ) ||\
                              ((cnt) == CTC_FS_Match_Cnt_3DB  ) ||\
                              ((cnt) == CTC_FS_Match_Cnt_4DB  ))

#define CTC_CH_MAX              2

