yushuo-ko/rtl8752h_sdk/inc/peripheral/rtl876x_captouch.h
typedef enum
{
    CTC_CH0 = 0,
    CTC_CH1 = 1,
} E_CTC_CH;

typedef union _FS_TOUCH_CNT01_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TOUCH_ACTIVE_CNT0: 10;
        uint32_t RSVD: 6;
        uint32_t TOUCH_ACTIVE_CNT1: 10;
        uint32_t RSVD2: 6;
    };
} FS_TOUCH_CNT01_TYPE;

typedef union _FS_TOUCH_CNT23_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TOUCH_ACTIVE_CNT2: 10;
        uint32_t RSVD: 6;
        uint32_t TOUCH_ACTIVE_CNT3: 10;
        uint32_t RSVD2: 6;
    };
} FS_TOUCH_CNT23_TYPE;

/* combine 0x158 & 0x15C for API usage */
typedef union _FS_TOUCH_CNT_TYPE
{
    uint16_t d16[4];
    struct
    {
        FS_TOUCH_CNT01_TYPE fs_touch_cnt_01;
        FS_TOUCH_CNT23_TYPE fs_touch_cnt_23;
    };
} FS_TOUCH_CNT_TYPE;

/** End of CTC_Exported_Constants
  * \}
  */

/*============================================================================*
 *                         Types
 *============================================================================*/
/**
 * \defgroup    CTC_Exported_Types CTC Exported Types
 *
 * \ingroup     CTC
 */

/**
 * \brief       CTC init structure definition
 *
 * \ingroup     CTC_Exported_Types
 */
typedef struct
{
//    uint32_t CTC_ClockSource;
    uint16_t CTC_BaselineIniEn;             /*!< Baseline initial function enable, HW will clear this bit to "0" after baseline initial. */
    uint8_t  CTC_DebounceTime;              /*!< Debounce time setting.*/
    uint8_t  CTC_DebounceEn;                /*!< Debounce function control: "0":disable; "1": enable.*/
    uint32_t CTC_SampleTime;                /*!< ADC sample time, active time. sample_time = 2^(CTC_SampleTime+2)*131072;unit is 131.072KHz;
                                                 sample number=4~512.Default: 110, sample number=256. */
    uint16_t CTC_ScanInterval;              /*!< Scan interval :Sleep time between 2 scan burst for all channels, range: 0~4095ms; code: 0~4095(0~0xFFF), unit is 1.024KHz cycle. (1/32 32.768KHz).
                                                 When this register set to 0 or 1, HW will scan continuously and has no sleep time; Recommend value: 60~480ms; Default: 0X3c(60ms).*/
    uint16_t CTC_BaselineUpdateStep;        /*!< Baseline update step every time for all channel.
                                                 This parameter can be a value of \ref ENHTIM_Clock_Divider*/
    uint16_t CTC_BaselineWeightFactor;      /*!< Baseline update weight factor for all channels; Factor=2 ^ (BASELINE_WT_FACTOR); Default: 0010.
                                                 This parameter can be a value of DISABLE or ENABLE */
    uint8_t CTC_ETCScanInterval;            /*!< ETC update interval between 2 scan period(sleep time )for all channel:
                                                Interval=(ETC_SCAN_INTERVAL+1)*Scan period; (1~128). Default: 0x2; (Update every scan period). */
    uint8_t CTC_ETCEn;                      /*!< Environmental cap tracking calibration function: "0":disable; "1": enable.
                                                This parameter can be a value of DISABLE or ENABLE */
    uint32_t CTC_SNRUpdateMode;             /*!< Specifies SNR update mode.
                                                This parameter can be a value of DISABLE or ENABLE */
    uint8_t CTC_ScanChannel;                /*!< Specifies scan channel contro.
                                                This parameter can be a value of DISABLE or ENABLE */
    uint8_t CTC_ScanChannelSwitchMode;      /*!< Specifies scan channel switch control.
                                                This parameter can be a value of \ref ENHTIM_Mode. */
//    uint8_t CTC_DBGEn;                    /*!< Enable debug mode.
//                                               This parameter leagel value range is from 0 ~ 2^32-2. */
    uint32_t CTC_DelayGuardInterval;        /*!< Delay guard interval 1 unit for 32k clock period (31.25us).*/
    uint32_t CTC_AdvancedGuardInterval;     /*!< Delay guard interval 1 unit for 32k clock period (31.25us)
                                                 This parameter can be a value of ENABLE or DISABLE. */
    uint32_t CTC_FastMatchCnt;              /*!< Specifies Difference digital data of channelx between CHx_DATA_AVE and BASELINE
                                                 This parameter can be a value of ENABLE or DISABLE. */
    uint32_t CTC_FastScanInerval;           /*!< Specifies Difference digital data of channelx between CHx_DATA_AVE and BASELINE
                                                 This parameter can be a value of ENABLE or DISABLE. */
    uint32_t CTC_FalseTouchCnt;             /*!< Specifies Difference digital data of channelx between CHx_DATA_AVE and BASELINE
                                                 This parameter can be a value of ENABLE or DISABLE. */
    uint32_t CTC_FalseAlarmCnt;             /*!< Specifies Difference digital data of channelx between CHx_DATA_AVE and BASELINE
                                                 This parameter can be a value of ENABLE or DISABLE. */
    uint32_t CTC_ReleaseActiveCnt;          /*!< Specifies Difference digital data of channelx between CHx_DATA_AVE and BASELINE
                                                 This parameter can be a value of ENABLE or DISABLE. */
} CTC_InitTypeDef;

typedef struct
{
    uint8_t CTC_ChannelEn;          /*!< Cap Sensor activity control of channelx.
                                         This parameter can be a value of ENABLE or DISABLE. */
    uint16_t CTC_BaselineData;      /*!< Specifies digital baseline data of channelx.
                                         This parameter can be 0x0 ~ 0xFFF. */
    uint16_t CTC_DifferenceTouchThd;/*!< Difference threshold data of touch judgement for channelx.
                                         This parameter can be 0x0 ~ 0xFFF. */
    uint16_t CTC_AbsoluteTouchThd;  /*!< Specifies absolute threshold data of touch judgement for channelx.
                                         This parameter can be 0x0 ~ 0xFFF. */
    uint32_t CTC_PNoiseThd;         /*!< The environmental pasitive noise threshold: the positive maximum capacitance change of raw data that is still considered an environmental change.
                                         This parameter can be 0x0 ~ 0xFF. */
    uint32_t CTC_NNoiseThd;         /*!< The environmental negative noise threshold: the negative maximum capacitance change of raw data that is still considered an environmental change.
                                         This parameter can be 0x0 ~ 0xFF. */
    uint8_t CTC_MBias;              /*!< Specifies Channelx mbias current tuning(sensitivity tuning) Touch bias current [5:0]: 8uA/4Ua/2uA/1uA/0.5uA/0.25uA.
                                         This parameter can be a value of \ref . */
} CTC_ChannelInitTypeDef;

/** End of CTC_Exported_Types
  * \}
  */
/*============================================================================*
 *                         Functions
 *============================================================================*/
/**
 * \defgroup    CTC_Exported_Functions  CTC Exported Functions
 * \{
 * \ingroup     CTC
 */

/**
 * \brief   Deinitialize the Cap Touch peripheral registers to their default reset values.
 * \return  None.
 */
void CTC_DeInit(void);

/**
 * @brief  Enable the CTCx peripheral IP clock and function.
 * @param  clock_source: CTCx peripheral clock source.
 *         This parameter can be one of the following values.
 *         \arg  CTC_CLOCK_SOURCE_1M: 1M clock source
 *         \arg  CTC_CLOCK_SOURCE_40M: 40M clock source
 * @retval None.
 */
void CTC_RCCConfig(uint32_t clock_source);

/**
  * @brief  Initializes the CTCx peripheral according to
  *         the specified parameters in the CTC_InitStruct.
  * @param  CTCx:  CTC peripheral.
  * @param  CTC_InitStruct: pointer to a CTC_InitTypeDef structure that
  *         contains the configuration information for the specified CTC peripheral.
  * @retval None
  */
void CTC_Init(CTC_TypeDef *CTCx, CTC_InitTypeDef *CTC_InitStruct);

/**
  * @brief  Initializes the specified channel.
  * @param  CTC_Channelx: specified channel
  * @param  CTC_ChannelInitStruct: pointer to a CTC_ChannelInitTypeDef structure that
  *         contains the configuration information for the specified CTC channel.
  * @retval None
  */
void CTC_ChannelInit(CTC_ChannelTypeDef *CTC_Channelx,
                     CTC_ChannelInitTypeDef *CTC_ChannelInitStruct);

/**
  * @brief  Fills each CTC_InitStruct member with its default value.
  * @param  CTC_InitStruct: Pointer to a CTC_InitStruct structure which will be initialized.
  * @return None.
  */
void CTC_StructInit(CTC_InitTypeDef *CTC_InitStruct);

/**
  * @brief  Fills each CTC_InitStruct member with its default value.
  * @param  CTC_InitStruct: Pointer to a CTC_InitStruct structure which will be initialized.
  * @return None.
  */
void CTC_ChannelStructInit(CTC_ChannelInitTypeDef *CTC_ChannelInitStruct);

/**
 * @brief     Enable or disable the specified Cap Touch interrupt.
 * \param[in] CTCx: The Cap Touch peripheral.
 * \param[in] CTC_INT: Specifies the Cap Touch interrupt source which to be enabled or disabled.
 *            This parameter can be any combination of the following values:
 *            \arg CTC_INT_FALSE_TOUCH_CH1: Channel 1 Touch cnt reach false touch cnt interrupt.
 *            \arg CTC_INT_FALSE_TOUCH_CH0: Channel 0 Touch cnt reach false touch cnt interrupt.
 *            \arg CTC_INT_N_NOISE_THD: Negative noise threshold overflow interrupt.
 *            \arg CTC_INT_FIFO_OVERFLOW: Raw code FIFO over flow interrupt
 *            \arg CTC_INT_P_NOISE_THD: Positive noise threshold overflow interrupt.
 *            \arg CTC_INT_TOUCH_RELEASE_CH1: Channel x release interrupt.
 *            \arg CTC_INT_TOUCH_RELEASE_CH0: Channel x release interrupt.
 *            \arg CTC_INT_TOUCH_PRESS_CH1: Channel x press interrupt.
 *            \arg CTC_INT_TOUCH_PRESS_CH0: Channel x press interrupt.
  * @param  NewState: New state of the Cap Touch interrupt.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void CTC_INTConfig(uint32_t CTC_INT, FunctionalState NewState);

/**
  * @brief  Enables or disables the specified Cap Touch peripheral.
  * @param  ENHTIMx: Cap Touch peripheral.
  * @param  NewState: New state of the Cap Touch peripheral.
  *         This parameter can be: ENABLE or DISABLE.
  * @retutn None.
  */
void CTC_Cmd(CTC_TypeDef *CTCx, FunctionalState NewState);

/**
 * @brief  Enable or disable system wake up of CTC.
 * @param  NewState: new state of the wake up function.
 *         This parameter can be: ENABLE or DISABLE.
 * @return None
 */
void CTC_SystemWakeupConfig(E_CTC_CH channel, FunctionalState NewState);

/**
  * @brief  Set CTC Scan interval for slow mode or fast mode.
  * @param  scan_interval: scan interval in units of 1s/1.024KHz (= 0.9765625 ms)
  *         Configurable range: 0x0~0xFFF (0~4095)
  *         Note that slow mode interval should not be lower then fast mode interval,
  *         Fast mode interval should be greater then total guard time for auxADC
  * @param  CTCMode: CTC_SLOW_MODE or CTC_FAST_MODE.
  * @retval ture: success, false: interval is out of range.
  */
bool CTC_SetScanInterval(uint16_t scan_interval, E_CTC_MODE CTCMode);

/**
  * @brief  Get touch active count from specified channel under fast mode.
  * @param  channel: specified channel
  * @retval touch active count
  */
uint16_t CTC_GetChannelTouchCount(E_CTC_CH channel);

/**
  * @brief  Get Cap Touch baseline init status.
  * @retval Cap Touch enable status. 1: Baseline initial, 0: Baseline initial done.
  */
__STATIC_INLINE FlagStatus CTC_GetBaselineInistatus(void)
{
    return (FlagStatus)((CTC->CR & BIT8) >> 8);
}

/**
  * @brief  Get Cap Touch enable status.
  * @retval Cap Touch enable status. 1: Running, 0: Non-runnung.
  */
__STATIC_INLINE bool CTC_IsRunning(void)
{
    return (CTC->CR & BIT0);
}

/**
  * @brief  Read Cap Touch mode.
  * @retval Cap Touch mode. 1: Fast mode, 0: Slow mode
  */
__STATIC_INLINE bool CTC_IsFastMode(void)
{
    return (CTC_FAST->TOUCH_SR & BIT8) >> 8;
}

/**
  * @brief  Check legality of specified channel.
  * @param  channel: specified channel.
  * @retval 1: Allowed, 0: Not allowed.
  */
__STATIC_INLINE bool CTC_IsChannelAllowed(E_CTC_CH channel)
{
    return (channel <= CTC_CH_MAX);
}

/**
  * @brief  Set relative touch threshold for related channel.
  * @param  channel: specified channel
  * @param  threshold: related threshold value.
  * @retval None
  */
__STATIC_INLINE void CTC_SetCHDifferenceThd(CTC_ChannelTypeDef *CTC_Channelx, uint16_t threshold)
{
    /* Check the parameters */
//    configASSERT(CTC_IsChAllowed(channel));
//    configASSERT(threshold <= 4095);
//    configASSERT(!CTC_IsRunning());

