yushuo-ko/rtl8752h_sdk/inc/peripheral/rtl876x_captouch.h
    CTC_Channelx->CR |= (uint32_t)threshold << 16;
}

/**
  * @brief  Get absolute threshold of touch judgement for specified channel.
  * @param  channel: specified channel
  * @param  threshold: Threshold value
  * @retval None
  */
__STATIC_INLINE void CTC_SetCHAbsoluteThd(CTC_ChannelTypeDef *CTC_Channelx, uint16_t threshold)
{
    /* Check the parameters */
//    configASSERT(CTC_IsChAllowed(channel));
//    configASSERT(threshold <= 4095);
//    configASSERT(!CTC_IsRunning());

    CTC_Channelx->TOUCH_TH |= threshold & 0xFFF;
}

/**
  * @brief  Set P noise threshold for related channel.
  * @param  channel: specified channel
  * @param  p_noise_threshold: Pnoise Threshold value.
  * @retval None
  */
__STATIC_INLINE void CTC_SetCHPNoiseThd(CTC_ChannelTypeDef *CTC_Channelx, uint8_t p_noise_threshold)
{
    /* Check the parameters */
//    configASSERT(CTC_IsChAllowed(channel));
//    configASSERT(p_noise_threshold <= 255);
//    configASSERT(!CTC_IsRunning());

    CTC_Channelx->TOUCH_TH |= (uint32_t)p_noise_threshold << 16;
}

/**
  * @brief  Set N noise threshold for related channel.
  * @param  channel: specified channel
  * @param  n_noise_threshold: Nnoise Threshold value.
  * @retval None
  */
__STATIC_INLINE void CTC_SetCHNNoiseThd(CTC_ChannelTypeDef *CTC_Channelx, uint8_t n_noise_threshold)
{
    /* Check the parameters */
//    configASSERT(CTC_IsChAllowed(channel));
//    configASSERT(n_noise_threshold <= 255);
//    configASSERT(!CTC_IsRunning());

    CTC_Channelx->TOUCH_TH |= (uint32_t)n_noise_threshold << 24;
}

/**
  * @brief  Set mbias current for specified channel.
  * @param  channel: specified channel
 * @param  mbias: mbias value, relate current = 0.25*mbias.
  * @retval None
  */
__STATIC_INLINE void CTC_SetChannelMbias(CTC_ChannelTypeDef *CTC_Channelx, uint8_t mbias)
{
//    /* Check the parameters */
//    configASSERT(CTC_IsChAllowed(channel));
//    configASSERT(mbias < 64);
//    configASSERT(!CTC_IsRunning());

    CTC_Channelx->MBIAS |= mbias & 0x3F;
}

/**
  * @brief  Get status for specified channel.
  * @param  channel: specified channel
  * @retval channel enable status.
  */
__STATIC_INLINE FlagStatus CTC_GetChannelStatus(CTC_ChannelTypeDef *CTC_Channelx)
{
    return (FlagStatus)(CTC_Channelx->CR & 0x1);
}

/**
  * @brief  Get Baseline data from specified channel.
  * @param  channel: Specified channel.
  * @retval Baseline data.
  */
__STATIC_INLINE uint16_t CTC_GetChannelBaseline(CTC_ChannelTypeDef *CTC_Channelx)
{
    return ((CTC_Channelx->CR & 0xFFF0) >> 4);
}

/**
  * @brief  Get relative threshold of touch judgement for specified channel.
  * @param  channel: specified channel
  * @retval Difference threshold of specified channel.
  */
__STATIC_INLINE uint16_t CTC_GetCHDifferenceThd(CTC_ChannelTypeDef *CTC_Channelx)
{
    return ((CTC_Channelx->CR >> 16) & 0xFFF);
}

/**
  * @brief  Get Absolute threshold of touch judgement for specified channel.
  * @param  channel: specified channel
  * @retval Difference threshold of specified channel.
  */
__STATIC_INLINE uint16_t CTC_GetCHAbsoluteThd(CTC_ChannelTypeDef *CTC_Channelx)
{
    return (CTC_Channelx->TOUCH_TH & 0xFFF);
}

/**
  * @brief  Get positive noise threshold for specified channel.
  * @param  channel: specified channel
  * @retval Noise threshold of specified channel.
  */
__STATIC_INLINE uint8_t CTC_GetCHPNoiseThd(CTC_ChannelTypeDef *CTC_Channelx)
{
    return ((CTC_Channelx->TOUCH_TH >> 16) & 0xFF);
}

/**
  * @brief  Get negative noise threshold for specified channel.
  * @param  channel: specified channel
  * @retval Noise threshold of specified channel.
  */
__STATIC_INLINE uint8_t CTC_GetCHNNoiseThd(CTC_ChannelTypeDef *CTC_Channelx)
{
    return ((CTC_Channelx->TOUCH_TH >> 24) & 0xFF);
}

/**
  * @brief  Get ave data from specified channel.
  * @param  channel: specified channel
  * @retval Average data
  */
__STATIC_INLINE uint16_t CTC_GetChannelAveData(CTC_ChannelTypeDef *CTC_Channelx)
{
    return (CTC_Channelx->DATA & 0xFFF);
}

/**
  * @brief  Get Cap Touch status under fast mode.
 * \param[in] channel: Specifies the Cap Touch channel.
 *            This parameter can be one of the following values:
 *            \arg CTC_CH3: Channel 3.
 *            \arg CTC_CH2: Channel 2.
 *            \arg CTC_CH1: Channel 1.
 *            \arg CTC_CH0: Channel 0.
 * \return    The new state of the Cap Touch channel(SET or RESET). bit4~bit0 each bit represent one channel.
 *            \retval SET: tounch.
 *            \retval RESET: un-tounch.
  */
__STATIC_INLINE FlagStatus CTC_GetChannelTouchStatus(E_CTC_CH channel)
{
    if (CTC_IsFastMode())
    {
        return (FlagStatus)((CTC_FAST->TOUCH_SR & 0xF) >> (uint8_t)channel);
    }
    else
    {
        return RESET;
    }
}

/**
 * \brief     Check whether the Cap Touch interrupt has occurred or not.
 * \param[in] CTCx: The Cap Touch peripheral.
 * \param[in] CTC_INT: Specifies the Cap Touch interrupt has occurred or not.
 *            This parameter can be any combination of the following values:
 *            \arg CTC_INT_FALSE_TOUCH_CH1: Channel 1 Touch cnt reach false touch cnt interrupt.
 *            \arg CTC_INT_FALSE_TOUCH_CH0: Channel 0 Touch cnt reach false touch cnt interrupt.
 *            \arg CTC_INT_N_NOISE_THD: Negative noise threshold overflow interrupt.
 *            \arg CTC_INT_FIFO_OVERFLOW: Raw code FIFO over flow interrupt
 *            \arg CTC_INT_P_NOISE_THD: Positive noise threshold overflow interrupt.
 *            \arg CTC_INT_TOUCH_RELEASE_CH1: Channel 1 release interrupt.
 *            \arg CTC_INT_TOUCH_RELEASE_CH0: Channel 0 release interrupt.
 *            \arg CTC_INT_TOUCH_PRESS_CH1: Channel 1 press interrupt.
 *            \arg CTC_INT_TOUCH_PRESS_CH0: Channel 0 press interrupt.
 * \return    The new state of the CTC_INT(SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void cap_touch_demo(void)
 * {
 *     ITStatus int_status = CTC_GetINTStatus(CTC, CTC_INT_TOUCH_PRESS_CH1);
 * }
 * \endcode
 */
__STATIC_INLINE ITStatus CTC_GetINTStatus(CTC_TypeDef *CTCx, uint32_t CTC_INT)
{
    /* Check the parameters */
    assert_param(IS_CTC_ALL_PERIPH(CTCx));

    ITStatus itstatus = RESET;

    if (CTCx->INT_SR & (CTC_INT))
    {
        itstatus = SET;
    }

    return itstatus;
}

/**
  * @brief  Get CTC Raw Interrupt (without hardware mask) Status.
 * \param[in] CTCx: The Cap Touch peripheral.
 * \param[in] CTC_INT: Specifies the Cap Touch interrupt has occurred or not.
 *            This parameter can be any combination of the following values:
 *            \arg CTC_INT_FALSE_TOUCH_CH1: Channel 1 Touch cnt reach false touch cnt interrupt.
 *            \arg CTC_INT_FALSE_TOUCH_CH0: Channel 0 Touch cnt reach false touch cnt interrupt.
 *            \arg CTC_INT_N_NOISE_THD: Negative noise threshold overflow interrupt.
 *            \arg CTC_INT_FIFO_OVERFLOW: Raw code FIFO over flow interrupt
 *            \arg CTC_INT_P_NOISE_THD: Positive noise threshold overflow interrupt.
 *            \arg CTC_INT_TOUCH_RELEASE_CH1: Channel 1 release interrupt.
 *            \arg CTC_INT_TOUCH_RELEASE_CH0: Channel 0 release interrupt.
 *            \arg CTC_INT_TOUCH_PRESS_CH1: Channel 1 press interrupt.
 *            \arg CTC_INT_TOUCH_PRESS_CH0: Channel 0 press interrupt.
 * \return    Raw interrupt status of the CTC_INT(SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void cap_touch_demo(void)
 * {
 *     ITStatus int_status = CTC_GetRawINTStatus(CTC, CTC_INT_TOUCH_PRESS_CH1);
 * }
 * \endcode
 */
__STATIC_INLINE ITStatus CTC_GetRawINTStatus(CTC_TypeDef *CTCx, uint32_t CTC_INT)
{
    /* Check the parameters */
    assert_param(IS_CTC_ALL_PERIPH(CTCx));

    ITStatus itstatus = RESET;

