yushuo-ko/rtl8752h_sdk/inc/peripheral/rtl876x_captouch.h
    if (CTCx->RAW_INT_SR & (CTC_INT))
    {
        itstatus = SET;
    }

    return itstatus;
}

/**
 * \brief     Clear CTC interrupt.
 * \param[in] CTCx: The Cap Touch peripheral.
 * \param[in] CTC_INT: Specifies the Cap Touch interrupt source which to be enabled or disabled.
 *            This parameter can be any combination of the following values:
 *            \arg CTC_INT_FALSE_TOUCH_CH1: Channel 1 Touch cnt reach false touch cnt interrupt.
 *            \arg CTC_INT_FALSE_TOUCH_CH0: Channel 0 Touch cnt reach false touch cnt interrupt.
 *            \arg CTC_INT_N_NOISE_THD: Negative noise threshold overflow interrupt.
 *            \arg CTC_INT_FIFO_OVERFLOW: Raw code FIFO over flow interrupt
 *            \arg CTC_INT_P_NOISE_THD: Positive noise threshold overflow interrupt.
 *            \arg CTC_INT_TOUCH_RELEASE_CH1: Channel x release interrupt.
 *            \arg CTC_INT_TOUCH_RELEASE_CH0: Channel x release interrupt.
 *            \arg CTC_INT_TOUCH_PRESS_CH1: Channel x press interrupt.
 *            \arg CTC_INT_TOUCH_PRESS_CH0: Channel x press interrupt.
 * \return    None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void cap_touch_demo(void)
 * {
 *     CTC_ClearINTPendingBit(CTC, CTC_INT_TOUCH_PRESS_CH0);
 * }
 * \endcode
 */
__STATIC_INLINE void CTC_ClearINTPendingBit(CTC_TypeDef *CTCx, uint32_t CTC_INT)
{
    /* Check the parameters */
    assert_param(IS_CTC_ALL_PERIPH(CTCx));

    /* Clear the IT */
    CTCx->INT_SCLR |= CTC_INT;
}

/**
 * \brief   Clear ALL CTC interrupt.
 * \param   None.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void cap_touch_demo(void)
 * {
 *     CTC_ClearAllINT();
 * }
 * \endcode
 */
__STATIC_INLINE void CTC_ClearAllINT(void)
{
    /* Clear the IT */
    CTC->INT_CLR |= BIT0;
}

/** End of CODEC_Exported_Functions
  * \}
  */

/** End of CODEC
  * \}
  */

#ifdef __cplusplus
}
#endif

#endif /* _RTL876X_CAPTOUCH_H_ */


/******************* (C) COPYRIGHT 2024 Realtek Semiconductor Corporation *****END OF FILE****/
